[
  {
    "name": "2048 AI",
    "short-description": "A 2048 AI agent trained with Q-learning and reinforcement learning algorithms to explore possible random moves in the game that can in turn yield high reward, thus enabling for exploitation of the game and yielding better gaming performance.",
    "long-description": "A 2048 AI agent trained with Q-learning and reinforcement learning algorithms to explore possible random moves in the game. The algorithms enable the agent to identify high-reward moves, thus improving performance through exploitation. The game is built with Tkinter, and is then controlled by the 2048AIAgent through array selection. To train the agent to make predictions for the next best move, each game calculates a Q-value determined by its actions, reward received, game state, and a previous Q-value if any. An epsilon value controls the randomness of the agent's actions; after a certain number of games, this value hits below zero, thus allowing the agent to shift to exploitation, making non-random predictions for the highest reward-yielding moves.",
    "team": ["Jay", "Abrar", "Rafid"],
    "link": "https://github.com/BYTE-Club-CCNY/2048-AI",
    "image": "https://d1tzawfcgeew72.cloudfront.net/2048AI.png",
    "tech-stack": ["Tkinter", "PyTorch", "NumPy"],
    "cohort": "Fall 2025",
    "topic": [
      "AI",
      "ML"
    ],
    "uuid": "80eb8a48-9172-4f6f-87ca-4ae89de1938c"
  },
  {
    "name": "Stockbros",
    "short-description": "StockBros is a simple application that tracks the stock price of a set companies. It updates the stock price in real time and simultaneously displays relevant news articles corresponding to specific dates. This dual aspect allows the user to relate the fluctuation in stock prices with major news events.",
    "long-description": "The stockbros application is designed to display stock information and related news. This program allows users to select one of many different stocks from a dropdown menu and specify a start date and an end date to define the date range for the stock data they wish to view. It then generates a plot of the selected stock's average price over the specified date range. The graph displays the average stock prices on the y-axis and dates on the x-axis. Below the graph, the application pulls up three news articles related to the selected stock within the specified date range, displaying clickable headlines. The user interface is built using React.js, the back-end logic is implemented with Python and Flask, and the graph is created using Pandas and Plotly. The news articles are fetched using the World News API.",
    "team": ["Kritan Baniya", "Mudassir Sami"],
    "link": "https://github.com/BYTE-Club-CCNY/StockBros",
    "image": "https://d1tzawfcgeew72.cloudfront.net/old_byte.png",
    "tech-stack": ["Pandas", "Plotly", "Flask", "React"],
    "cohort": "Spring 2024",
    "topic": [
      "Data Science",
      "Finance"
    ],
    "uuid": "5dca7d6e-5131-434f-9eb9-5670a820a260"
  },
  {
    "name": "TrackLeet",
    "short-description": "A chrome extension built by a team of aspiring software engineers with the aim to assist students in their journey of leetcode grinding through automated tracking, reminders, and more.",
    "long-description": "TrackLeet is a chrome extension built by a team of aspiring software engineers with the aim to assist students in their journey of leetcode grinding. After a quick setup process, the extension automatically tracks the user’s leetcode progress. When submitting an accepted answer, the extension tracks the completion and displays previously attempted problems for progress check over time. If a user does not successfully complete a question, the extension will log the failed attempt and notify them through an email system in 2 weeks. Through repetition in learning students are more likely to retain key insights and strategies used when tackling the problem. Furthermore, users get an hour to complete the question or they have the option to adjust the time catered to their needs. Our learning journey began with nothing but frustration, however you can start right away with a companion that makes your journey efficient, organized, and downright enjoyable!",
    "team": ["Abdul", "Ivan", "Mohammad", "Brandon"],
    "link": "https://github.com/BYTE-Club-CCNY/leetcode-tracker",
    "image": "https://d1tzawfcgeew72.cloudfront.net/trackleet.png",
    "tech-stack": ["React", "JavaScript", "Supabase"],
    "cohort": "Spring 2024",
    "topic": [
      "Leetcode",
      "Chrome Extension",
      "Web Development",
      "Authentication"
    ],
    "uuid": "e00bfd77-58a4-4d2f-a56e-6fc5b8280454"
  },
  {
    "name": "Don't Be Alarmed",
    "short-description": "Don't Be Alarmed is an alarm app with a twist with the intention to keep you awake after your alarm goes off. Once the alarm sounds, it requires the user to complete an activity to shut it off, stimulating their mind and preventing them from a cycle of snoozing.",
    "long-description": "Don't Be Alarmed is an Android alarm app that incorporates activities to ensure the user is fully awake before turning off the alarm to prevent the user from falling back asleep. Currently, the app offers basic alarm functionality and the option of a math game activity. Once the alarm sounds, the user must solve five math problems correctly to complete the activity and shut it off. The initial prototype was developed in Figma to provide an intuitive and visually pleasing user interface. It was then built in Android Studio using Kotlin and Jetpack Compose to display the designed layout for the frontend and supported by JSON Object to store a database of alarm information for the backend. These tools enable the app to showcase pages featuring alarm lists, customization settings, and activities. Once the user’s scheduled time arrives, it triggers a pre-selected alarm sound and activity.",
    "team": ["Franklin", "Judy", "Thanjila"],
    "link": "https://github.com/BYTE-Club-CCNY/DontBeAlarmed",
    "image": "https://d1tzawfcgeew72.cloudfront.net/DontBeAlarmed.png",
    "tech-stack": [
      "Kotlin",
      "Jetpack Compose",
      "JSON Object",
      "Android Studio"
    ],
    "cohort": "Spring 2024",
    "topic": [
      "Android App Development"
    ],
    "uuid": "9fe8f025-d0a4-4a88-abb5-184da85db827"
  },
  {
    "name": "BYTE Website",
    "short-description": "The BYTE website is a platform that showcases the projects and achievements of the BYTE club members. It is a hub for all things BYTE, including information about the club, its members, and the projects they have worked on.",
    "long-description": "The BYTE website is a platform that showcases the projects and achievements of the BYTE club members. It is a hub for all things BYTE, including information about the club, its members, and the projects they have worked on. The website is built using React.js, a popular JavaScript library for building user interfaces. It features a clean and modern design that is easy to navigate and visually appealing. The website is divided into several sections, including a home page, about page, projects page, and contact page. Each section provides valuable information about the club and its members, as well as links to their social media profiles and GitHub repositories. The website is fully responsive and works on all devices, from desktop computers to smartphones and tablets.",
    "team": ["Jay", "Evan", "Ayan", "Fahad"],
    "link": "https://github.com/BYTE-Club-CCNY/byte",
    "image": "https://d1tzawfcgeew72.cloudfront.net/old_byte.png",
    "tech-stack": [
      "Next.js",
      "Typescript",
      "Tailwind CSS",
      "AWS Amplify",
      "Github Actions"
    ],
    "cohort": "Summer 2024",
    "topic": [
      "Web Development"
    ],
    "uuid": "d78df4b2-4ad6-4c0e-82b1-31473c4ef9f2"
  },
  {
    "name": "BYTE Server",
    "short-description": "The BYTE server is the backend server that supports the BYTE website. It is responsible for handling requests from the website, fetching data from the database, and sending responses back to the client.",
    "long-description": "The BYTE server is a backend server that supports the BYTE website. It is responsible for handling requests from the website, fetching data from the database, and sending responses back to the client. The server is hosted on AWS EC2 on a Bun runtime. It uses Express.js, a web application framework for Node.js, to handle HTTP/S requests and responses. The server interacts with a PostgreSQL database - JSON as backup - to store and retrieve data for the website. The purpose of the server is to allow for the website to call only on the data they require & serve projects to the user.",
    "team": ["Ivan", "Abrar", "Fahad"],
    "link": "https://github.com/BYTE-Club-CCNY/byte-server",
    "image": "https://d1tzawfcgeew72.cloudfront.net/old_byte.png",
    "tech-stack": [
      "Node.js",
      "Bun",
      "Express",
      "PostgreSQL",
      "AWS EC2",
      "Github Actions",
      "Docker"
    ],
    "cohort": "Summer 2024",
    "topic": [
      "Web Development",
      "Backend",
      "Server Development",
      "API",
      "Postgres"
    ],
    "uuid": "52a901bf-685a-4320-9336-5ce7785e4f18"
  }
]
